##############################################################
##         Initial Encounter Configuration                  ##
## Script Generated for Undergrad class of microelectronics ##
## Generated by Matheus Moreira/Fernando Moraes - 2018      ##
##                                                          ##
## Functionalities of this script:                          ##
##  -Place standard cells                                   ##
##  -Place core pins                                        ##
##  -Perform initial route of the design                    ##
##############################################################

# Pre Placement Optimization
#time_design -pre_place
#eval_legacy { setPlaceMode -congEffort high }

##Place the design
place_design

##check pre CTS 
opt_design -pre_cts
time_design -pre_cts

# Clock Tree Synthesis
ccopt_design
time_design -post_cts

# Post CTS Optimization
opt_design -post_cts
time_design -post_cts

report_timing
